Preload("Quest69205.lua")

-- 定义 NPC 表 : NPC 表是个 lua table, 名称要与脚本名称相同
Npc00693 = {							-- 孙小红
	npc_id = 693,						-- NPC ID
	name = GetNpcName(693),				-- NPC 名称
										-- NPC 会派出的任务表
}
-- Npc00019 对话方法，bProcess 为脚本处理阶段
function Npc00693:Talk(bProcess) 
 
 --[[
  local Question ={
          {title="“窗前明月光”中,从左至右第3个字是什么字？",          a1="明", a2="月", a3="线", a4="宫", r=1},
          {title="“疑是地上霜”中,从左至右第5个字是什么字？",          a1="我", a2="没", a3="线", a4="霜", r=4},
          {title="“举头望明月”中,从左至右第1个字是什么字？",          a1="傻", a2="举", a3="啊", a4="跑", r=2},
          {title="“低头思故乡”中,从左至右第4个字是什么字？",          a1="和", a2="级", a3="故", a4="了", r=3},
          {title="“开开心()”中,最后一个字应该是什么字？",          a1="心", a2="开", a3="去", a4="发", r=1},
          {title="“大吉大()”中,最后一个字应该是什么字？",          a1="去", a2="利", a3="新", a4="年", r=2},
          {title="“恭喜发()”中,最后一个字应该是什么字？",          a1="穷", a2="哦", a3="哈", a4="财", r=4},
          {title="“一本万()”中,最后一个字应该是什么字？",          a1="菜", a2="吖", a3="请", a4="利", r=4},
          {title="“一生一()”中,最后一个字应该是什么字？",          a1="来", a2="世", a3="别", a4="给", r=2},
          {title="“1+1=?”中,正确的答案应该是？",          a1="2", a2="1", a3="3", a4="5", r=1},
          {title="“1+3=?”中,正确的答案应该是？",          a1="8", a2="0", a3="4", a4="9", r=3},
          {title="“5+5=?”中,正确的答案应该是？",          a1="15", a2="10", a3="74", a4="19", r=2},
          {title="“15+5=?”中,正确的答案应该是？",          a1="150", a2="100", a3="20", a4="15", r=3},
          {title="“145+5=?”中,正确的答案应该是？",          a1="110", a2="150", a3="120", a4="215", r=2},
          {title="“100+100=?”中,正确的答案应该是？",          a1="200", a2="350", a3="221", a4="285", r=1},
          {title="“人”字,请问是属于那个国家的文字？",          a1="韩国", a2="日本", a3="中国", a4="美国", r=3},
          {title="“你好,我来之中国”中,请问文中说明来之那个国家？",          a1="意大利", a2="泰国", a3="巴西", a4="中国", r=4},
          {title="“你好,我来之日本”中,请问文中说明来之那个国家？",          a1="中国", a2="韩国", a3="日本", a4="俄罗斯", r=3},
          {title="“你好,我来之欧洲”中,请问文中说明来之那个洲？",          a1="亚洲", a2="欧洲", a3="非洲", a4="蓝美洲", r=2},
          {title="“你好,我来之蓝美洲”中,请问文中说明来之那个洲？",          a1="亚洲", a2="欧洲", a3="非洲", a4="蓝美洲", r=4},
          {title="“5478548512”中,请问第5位是什么数字？",          a1="2", a2="1", a3="5", a4="8", r=3},
          {title="“9635452145”中,请问第10位是什么数字？",          a1="4", a2="9", a3="1", a4="5", r=4},
          {title="“1547658521”中,请问第3位是什么数字？",          a1="4", a2="2", a3="6", a4="7", r=1},
          {title="“小明爱吃豆腐”中,请问小明爱吃的是什么食物？",          a1="黄瓜", a2="可乐", a3="豆腐", a4="茄子", r=3},
          {title="“小明爱吃黄瓜”中,请问小明爱吃的是什么食物？",          a1="豆腐", a2="烧白", a3="茄子", a4="黄瓜", r=4},
          {title="“小明爱吃土豆”中,请问小明爱吃的是什么食物？",          a1="西瓜", a2="黄豆", a3="土豆", a4="南瓜", r=3},
          {title="“小明爱吃葡萄”中,请问小明爱吃的是属于什么类型的食物？",          a1="水果", a2="熟食", a3="冷饮", a4="饮料", r=1},
          {title="“小明爱喝可乐”中,请问小明爱喝的是属于什么类型的食物？",          a1="甜食", a2="烟", a3="药", a4="饮料", r=4},
          {title="“小明很喜欢小红”中,请问小明喜欢的人是谁？",          a1="傻逼", a2="妈妈", a3="小红", a4="爸爸", r=3},
          {title="“小明很喜欢小蓝”中,请问小明喜欢的人是谁？",          a1="爷爷", a2="小蓝", a3="奶奶", a4="妹妹", r=2},
          {title="“太阳是什么形状？”中,请问正确的答案是什么？",          a1="长方形", a2="四边形", a3="三角形", a4="圆形", r=4},
          {title="“月亮是什么形状？”中,请问正确的答案是什么？",          a1="圆形", a2="四边形", a3="三角形", a4="长方形", r=1},
          {title="“地球是什么形状？”中,请问正确的答案是什么？",          a1="六边形", a2="圆形", a3="四边形", a4="长方形", r=2},
          {title="“我爱你”中,请问用英语正确表达应该是？",          a1="Ito Lay", a2="IY UH EHG", a3="I LovE YOU", a4="莪爱你", r=3},
          {title="下面英文骂人的正确答案是？",          a1="OIUIIU", a2="PPPQOQO", a3="Fuck", a4="Make", r=3},
          {title="一个“忄”，一个“青”组合后为什么字？",          a1="去", a2="我", a3="情", a4="跑", r=3},
          {title="一个“父”，一个“多”组合后为什么字？",          a1="爷", a2="我", a3="儿", a4="爹", r=4},
          {title="“父”字的正确拼音应该为？",          a1="ai", a2="po", a3="fu", a4="qi", r=3},
          {title="“耶”字的正确拼音应该为？",          a1="aq", a2="ye", a3="az", a4="we", r=2},
          {title="“妹”字的正确拼音应该为？",          a1="lop", a2="qing", a3="mei", a4="ay", r=3},
          {title="“大海龟”是出现在那个地图的？",          a1="长安", a2="江南野外", a3="花果山", a4="东海湾", r=4},
          {title="“野猪”是出现在那个地图的？",          a1="北俱芦洲", a2="龙窟一层", a3="江南野外", a4="花果山", r=3},
          {title="“山贼”是出现在那个地图的？",          a1="小西天", a2="长安城", a3="大唐国境", a4="傲来国", r=3},
          {title="“龙龟”是出现在那个地图的？",          a1="长寿村", a2="蓬莱仙岛", a3="龙宫", a4="天宫", r=2},
          {title="“红萼仙子”是出现在那个地图的？",          a1="方寸山", a2="长安", a3="月宫", a4="蓬莱仙岛", r=4},
          {title="“大海龟”是多少级可以携带的？",          a1="1O级", a2="80级", a3="5级", a4="0级", r=4},
          {title="双方到月老结婚必须友好度满足多少点？",          a1="0点", a2="1点", a3="66点", a4="1000点", r=4},
          {title="双方结拜必须友好度满足多少点？",          a1="100点", a2="10点", a3="1000点", a4="50点", r=3},
          {title="请问荼蘼花事中的神兽在哪里可以看到？",          a1="江南野外", a2="蓬莱仙岛", a3="长安天台", a4="花果山", r=3},
          {title="请问荼蘼花事中进游戏后送的是什么神兽？",          a1="大海龟", a2="巨蛙", a3="超级神兔", a4="超级大熊猫", r=4},
          {title="请问荼蘼花事中目前有炼妖系统吗？",          a1="有", a2="没有", a3="不知道", a4="好像有", r=1},
          {title="四叶花可以恢复人物多少点气血？",          a1="400", a2="20", a3="60", a4="40", r=4},
          {title="麝香可以恢复人物多少点魔法？",          a1="400", a2="100", a3="600", a4="400", r=2}
          }
  
  
  local Q = {
       {title="四叶花可以恢复人物多少点气血？",r="40"},
       {title="麝香可以恢复人物多少点魔法？",r="100"},
       {title="山药可以恢复人物多少点气血？",r="40"},
       {title="丁香水可以恢复人物多少点魔法？",r="75"},
       {title="血色茶花可以恢复人物多少点气血？",r="150"},
       {title="金疮药可以恢复人物多少点气血？",r="400"},
       {title="紫丹罗可以恢复人物多少点魔法？",r="20"},
       {title="熊胆可以恢复人物多少点气血？",r="200"},
       {title="草果可以恢复人物多少点伤势？",r="10"},
       {title="鬼切草可以恢复人物多少点魔法？",r="40"},
       {title="七叶莲可以恢复人物多少点气血？",r="60"},
       {title="九香虫可以恢复人物多少点伤势？",r="15"},
       {title="月见草可以恢复人物多少点气血？",r="40"},
       {title="百色花可以恢复人物多少点魔法？",r="30"}
  }
  local S = RandTable(Q)
  local y = math.random(2,2)
  local flag = player:GetQuests():GetFlag(693);
  
--  NpcSay(string.format("%s",flag))
  Quest69205:Take()
  NpcAsk("我这里可以领取宝图任务,你要领取吗?")
  SetAnswer(1,"领取")
  SetAnswer(2,"离开")
  WaitAnswer(2)
  if GetAnswer() == 1 then
    local R = RandTable(Question)
    NpcAsk(string.format("%s",R.title))
    SetAnswer(1, string.format("%s",R.a1))
    SetAnswer(2, string.format("%s",R.a2))
    SetAnswer(3, string.format("%s",R.a3))
    SetAnswer(4, string.format("%s",R.a4))
    WaitAnswer(4,30)
    if GetAnswer() == R.r then
      
      if player:GetHonor() < 2 then
        NpcSay("少侠威望不足2点,如何让我相信你有能力铲除强盗？")
        return
      end
      if not bProcess then
        Quest69205:Take()
        player:ChangeHonor(-2)
      end
    end
  end
end
 
 

--]]
  local tx = npc:GetCurPosX()
  local ty = npc:GetCurPosX()
  local x = player:GetCurPosX()
  local y = player:GetCurPosY()
  if PosInRange(tx, ty, x, y, 4) then
    NpcAsk("我这里可以领取宝图任务,你要领取吗?"..RandomLine(10))
    SetAnswer(1,"领取")
    SetAnswer(2,"离开")
    WaitAnswer(2)
    if GetAnswer() == 1 and bProcess then
      script:SetSaying(true)
      if not bProcess then
		  	player:AntiHack()
	    end
      if player:GetHonor() < 2 then
      NpcSay("少侠威望不足2点,如何让我相信你有能力铲除强盗？")
      return
    end
    Quest69205:Take()
    player:ChangeHonor(-2)
  end
  else
    NpcAsk("这么远对别人说话可是不礼貌的行为哟"..RandomLine(10))
	  SetAnswer(1,"离开")
	  WaitAnswer(1)
  end
end
  
function RandomLine(MaxLine)
    local r = math.random(3,MaxLine)
	local t = ""
    for i=1, r do
		t = tostring(t)..tostring("\r.")
	end
	return t
end





-- 必需在脚本最后将 NPC 表加入系统中
AddNpcTable(Npc00693)
