Preload("Quest69203.lua")
Npc300086 = {							-- 龙舟接引人1
	npc_id = 300086,						-- NPC ID
	name = GetNpcName(300086),				-- NPC 名称
										-- NPC 会派出的任务表
}

--  对话方法，bProcess 为脚本处理阶段
function Npc300086:Talk(bProcess)
	if npc then
		NpcAsk("欢迎参加中国梦幻古龙游泳大赛，我是1号接引人。")
		SetAnswer(1,"开始挑战")
		SetAnswer(2,"等等，还没准备好")
		WaitAnswer(2)
		if GetAnswer() == 1 then
			local Day = LuaI.GetRealDay(LuaI.GetServiceTime())
			local Hour = LuaI.GetRealHour(LuaI.GetServiceTime())
	--[[		if not ( Day >= 19 and Day <= 23 ) or not ( ( Hour >= 10 and Hour < 12 ) or ( Hour >= 15 and Hour < 17 ) or ( Hour >= 19 and Hour < 23 ) ) then
				NpcSayParty("对不起，你们所参加轮次的中国梦幻古龙游泳大赛已经结束，各位大侠请回吧。")
				return
			end--]]
			if not party then
				NpcSay("挑战人数不能少于\#G5\#W人。")
				return
			end
			if party:GetRealMemNum() < 5 then
				NpcSayParty("挑战人数不能少于\#G5\#W人。")
				return
			end
			for i = 0, party:GetRealMemNum() - 1 do
				local member = party:GetInPartyMember(i)
				local q = member:GetQuests():GetQuest(69203)
				if q == nil then
					NpcSayParty(string.format("\#P%s\#W是哪来的观众，混在参赛选手里面捣什么乱？",member:GetName()))
					return
				end
				if q:GetTargetNpcId(1) ~= npc:GetNpc_id() then
					NpcSayParty(string.format("大侠\#P%s\#W别来捣乱了，找你该找的人去吧。",member:GetName()))
					return
				end
				if q:IsFailed() then
					NpcSayParty(string.format("大侠\#P%s\#W，你的中国梦幻古龙游泳时间已经用完。",member:GetName()))
					return
				end
				if member:GetQuests():TimeMarkOver(697, 1) == false then
					NpcSayParty(string.format("大侠\#P%s\#W刚才挑战失败，需要休息一下再来吧。",member:GetName()))
					return
				else
					member:GetQuests():RemoveTimeMark(697)
				end
			end
			
			
			
			local Question ={
					{id=1, title="清代官服上绣有方形图案，称为“补子”，其中一品官的图案是？",                  a1="孔雀",   a2="仙鹤",    a3="凤凰",     a4="鸳鸯",r=2},
					{id=2, title="古代成语中“不分皂白”中的皂什么颜色？",                           a1="绿色",   a2="红色",    a3="黄色",     a4="黑色",r=4},
					{id=3, title="古代军队调兵遣将的信物是？",a1="龙符",                   a2="狮符",    a3="虎符",     a4="马符",r=3},
					{id=5, title="神医扁鹊是哪个朝代的人？",a1="上古时代",             a2="春秋战国",    a3="宋朝",     a4="唐朝",r=2},
					{id=6, title="以下不属于五谷的是？",                        a1="黍",   a2="稷",    a3="菽",     a4="蒜",r=4},
					{id=7, title="“不鸣则已,一鸣惊人”的典故源于？",                 a1="楚庄王",   a2="楚孝公",    a3="楚廉公",     a4="楚敬公",r=1},
					{id=8, title="古代名为“珮”的首饰，是佩带在哪里的？",          a1="头顶",   a2="前额",    a3="腰间",     a4="鞋上",r=3},
					{id=10, title="造纸术是在什么朝代发明的？",a1="东晋",                    a2="西晋",    a3="东汉",     a4="西汉",r=3},
					{id=11, title="成语“汗牛充栋”的正确解释是？",                         a1="形容工作辛苦",    a2="形容家境富裕",    a3="形容人山人海",     a4="形容藏书繁多",r=4},
					{id=12, title="成语“沐猴而冠”的正确解释是？",                      a1="形容穿着怪异",    a2="形容虚有其表",    a3="形容生活奢侈",     a4="形容小人得志",r=2},
					{id=13, title="成语“一衣带水”的正确解释是？",                      a1="形容一水之隔",     a2="形容雾气很大",   a3="形容天气炎热",     a4="形容大雨倾盆",r=1},
					{id=14, title="成语“噤若寒蝉”的正确解释是？",                     a1="形容天气寒冷",    a2="形容体质很差",   a3="形容沉默不语",    a4="形容语无伦次",r=3},
					{id=15, title="成语“兵不血刃”的正确解释是？",                    a1="形容战斗力差",    a2="形容不务正业",    a3="形容领导无方",    a4="形容不战而胜",r=4},
					{id=16, title="成语“门可罗雀”的正确解释是？",                      a1="形容市场繁荣",    a2="形容门庭若市",  a3="形容门庭冷落",   a4="形容建筑宏大",r=3},
					{id=17, title="成语“一曝十寒”的正确解释是？",                     a1="形容没有恒心",   a2="形容生活艰难",  a3="形容天气突变",   a4="形容过程繁多",r=1},
					{id=18, title="成语“含沙射影”的正确解释是？",                a1="形容辛苦劳作",   a2="形容造谣陷害",   a3="形容天气突变",   a4="形容武艺高超",r=2},
					{id=19, title="成语“投桃报李”的正确解释是？",                       a1="形容恩将仇报",   a2="形容不拘小节",       a3="形容礼尚往来",   a4="形容水果丰收",r=3},
					{id=20, title="成语“一日三秋”的正确解释是？",                   a1="形容天气无常",   a2="比喻珍惜时间",   a3="比喻虚度光阴",   a4="形容思慕心切",r=4},
					{id=21, title="成语“瓜田李下”的正确解释是？",                 a1="形容劳作辛苦",   a2="容易引起误会",   a3="暗指归隐山林",  a4="比喻田园风光",r=2},
					{id=22, title="成语“剖腹藏珠”的正确解释是？",                a1="形容病入膏肓",    a2="暗指重大机密",   a3="比喻爱财如命",   a4="形容忠心不二",r=3},
					{id=23, title="成语“白龙鱼服”的正确解释是？",             a1="形容微服出行的危险",   a2="形容以弱胜强",    a3="暗指不懂装懂的门外汉",   a4="形容人不可貌相",r=1},
					{id=24, title="成语“开门揖盗”的正确解释是？",                       a1="比喻为民锄害",    a2="形容窃贼胆大无顾忌",   a3="形容胆小怕事",   a4="比喻引狼入室", r=4},
					{id=25, title="古代名为“铜权”的金属器物，是现在的？",                   a1="香炉",    a2="秤砣",   a3="酒壶",   a4="铜镜",r=2},
					{id=26, title="古代诗歌的“风、雅、颂”中“风”指的是？",            a1="《国风》",    a2="《民风》",    a3="《秋风》",   a4="《世风》",r=1},
					{id=27, title="古代时，人们用“十二生肖”对应十二地支，其中与“辰”对应的是？",            a1="虎",    a2="蛇",   a3="羊",   a4="龙",r=4},
					{id=28, title="以下不是古代“订婚”习俗的是？",                                    a1="选吉日",    a2="算八字",      a3="送戒指",  a4="摆喜宴",r=3},
					{id=29, title="按古代兄弟排行的顺序，次子应该称为？",a1="伯",    a2="仲",    a3="叔",   a4="季",r=2},
					{id=30, title="以下不是古代“春节”习俗的是？",a1="贴春联",   a2="赏月亮",   a3="舞狮子",   a4="吃饺子",r=2},
					{id=31, title="古时候人们所说的“元旦”是指哪一天？",a1="春节",    a2="正月十五",       a3="一月初一",   a4="二月初二",r=1},
					{id=32, title="“仲夏”在古代时令中是指农历几月？",a1="四月",    a2="五月",   a3="六月",   a4="七月",r=2},
					{id=33, title="四书五经中的“五经”是指？",a1="诗经、周礼、仪礼、礼记、左传",a2="大学、中庸、论语、孟子、六艺",a3="诗、书、礼、易、春秋",a4="周礼、诗、书、论语、孟子",r=3},
					{id=34, title="古代时对厨师职业的人称为？",a1="师",    a2="丁",  a3="保",   a4="庖",r=4},
					{id=35, title="从中国古代的神话传说来看，以下与月亮无关的是？",a1="夸父",    a2="兔",   a3="蟾蜍",   a4="桂树",r=1},
					{id=36, title="战国时期，各国都有自己独特的货币，其中使用“铲形币”的是？",a1="楚国",    a2="燕国",   a3="秦国",   a4="赵国",r=4},
					{id=37, title="古代的“走马灯”是一种什么类型的灯？",a1="马车上的照明灯",    a2="军队传递信息的信号灯",   a3="能够旋转的装饰灯",   a4="马路上的引路灯",r=3},
					{id=38, title="“五禽戏”起源于汉代，它属于？",a1="比较早期的的戏剧",   a2="强身健体的功法",    a3="一种迷信活动",   a4="一套武学功夫",r=2},
					{id=39, title="古代发明的“云梯”按用途来讲属于？",a1="建筑器材",   a2="交通用具",   a3="攻城器械",  a4="农业用具",r=3},
					{id=40, title="战国时期的兵器大多用哪种材料制成？",a1="黄铜",   a2="生铁",   a3="精钢",   a4="青铜",r=4},
					{id=41, title="佛教的起源地是？",a1="东洋",   a2="波斯",   a3="天竺",   a4="希腊",r=3},
					{id=42, title="道教创始于哪个朝代？",a1="东晋",   a2="西晋",    a3="东汉",   a4="西汉",r=3},
					{id=43, title="“佛家三宝”是指什么？",a1="佛，法，僧",   a2="佛，道，理",    a3="佛，理，法",   a4="佛，僧，道",r=1},
					{id=44, title="以下不属于佛教“四谛”教义的是？",a1="空",   a2="灭",   a3="苦",   a4="集",r=1},
					{id=45, title="灵宝天尊是道教“三清”中的哪一位？",a1="太清",   a2="上清",  a3="中清",   a4="晶请",r=2},
					{id=46, title="济公在哪座寺庙出家？", a1="乌纱寺",   a2="绝尘寺",   a3="灵隐寺",   a4="念经寺",r=3},
					{id=47, title="以下不属于佛教“横三世佛”的是？",a1="药师佛",   a2="阿弥陀佛",   a3="释迦牟尼佛",   a4="弥勒佛",r=4},
					{id=48, title="“有教无类”是以下哪位提出的观点？",a1="孔子",   a2="老子",   a3="孟子",   a4="周子",r=1},
					{id=49, title="佛家说：“救人一命，胜造七级浮屠。”其中浮屠的意思指的是？",a1="阶梯",   a2="古楼",  a3="宝塔",   a4="城墙",r=3},
					{id=50, title="《金刚经》是哪个教派的著作？",a1="伊斯兰教",   a2="道教",   a3="基督教",   a4="佛教",r=4},
					{id=51, title="古人所称的“顿首”之礼是指？",a1="点头问候",   a2="跪而头叩地",   a3="请客人吃顿饭",   a4="拱手弯腰示礼",r=2},
					{id=52, title="古人讲究谦辞礼让，谈到自己儿子时一般称为？",a1="令郎",   a2="令堂",   a3="吾犬",   a4="犬子",r=4},
					{id=53, title="古人讲究尊称礼节，谈到对方父亲时一般称为？",a1="令尊",   a2="令堂",   a3="泰山",   a4="泰斗",r=1},
					{id=54, title="唐朝时六渡日本宣扬佛教为当时两国邦交做出重大贡献的是？",a1="玄奘",   a2="郑和",   a3="鉴真",   a4="王昭君",r=3},
					{id=55, title="古人所称的“拙荆”是指？",a1="对方的丈夫",   a2="对方的妻子",    a3="自己的丈夫",   a4="自己的妻子",r=4},
					{id=56, title="中国古代的“敦煌艺术”源于中国哪个教派？",a1="道教",   a2="佛教",   a3="基督教",   a4="波斯教",r=2},
					{id=57, title="以下不是古代祭祀常用牲畜的是？",a1="猪",   a2="牛",  a3="羊",   a4="马",r=4},
					{id=58, title="以下不是古代“祭祀”准备活动的是？",a1="念经",   a2="沐浴",    a3="更衣",   a4="斋戒",r=1},
					{id=59, title="古代所称“先考”是一种尊敬的称法，指的是？",a1="已逝世恩师",   a2="已逝世的兄长",   a3="已逝世的父亲",   a4="已逝世的母亲",r=3},
					{id=60, title="古时人称“情谊契合、亲如兄弟”的朋友为？",a1="金兰之交",   a2="患难之交",  a3="莫逆之交",  a4="刎颈之交",r=1},
					{id=61, title="“皈依三宝”是成为正信佛教徒的第一课，其中三宝是指？",a1="尊敬、福德、善人",   a2="佛、法、僧",   a3="金银、珍珠、玛瑙",   a4="同修、同解、同悦",r=2},
					{id=62, title="拜佛时香客送上的“香火钱、香油钱”是用来？",      a1="购买灯油",   a2="作为拜师费用",  a3="用请和尚颂经",    a4="捐赠给寺庙",r=4},
					{id=63, title="在寺庙里总管各项事务的一位僧人称为？",a1="护法禅师",   a2="方丈总管",    a3="主持方丈",   a4="护法长老",r=3},
					{id=64, title="“五台山”是中国佛教四大名山之一，,它位于哪个省？",a1="山西",  a2="安徽",    a3="四川",   a4="浙江",r=1},
					{id=65, title="佛教中人所用的“钵”是一种？",a1="容器",   a2="餐具",  a3="乐器",   a4="茶具",r=2},
					{id=66, title="唐朝的高的学府是？",a1="上书院",   a2="国书院", a3="太子监",   a4="国子监",r=4},
					{id=67, title="“四羊方尊”是哪个朝代的文物？",a1="周",   a2="元",  a3="商",   a4="夏",r=3},
					{id=68, title="“罢黜百家,独尊儒术”是哪位君主采取的制度？",a1="汉武帝",   a2="汉景帝", a3="汉元帝",   a4="汉文帝",r=1},
					{id=69, title="“王侯将相，宁有种乎”是谁提出的口号？",a1="张夏，吴元",   a2="张夏，陈胜", a3="陈胜，吴广",   a4="吴广，吴元",r=3},
					{id=70, title="洛阳白马寺创建于？",a1="东周",   a2="西周",  a3="东晋",   a4="东汉",r=4},
					{id=71, title="“将相和”的两位主角廉颇和蔺相如是春秋战国的哪国人？",a1="燕国",   a2="赵国",            a3="魏国",   a4="秦国",r=2},
					{id=72, title="唐太宗李世民的年号是什么？",a1="武德",   a2="咸亨",  a3="弘道",   a4="贞观",r=4},
					{id=73, title="古代的平遥古城位于今天的哪里？",a1="山西省中部",   a2="陕西省中部",  a3="宁夏自治区中部",   a4="西藏自治区中部",r=1},
					{id=74, title="成语“鸡鸣狗盗”与战国四君子哪位有关？",a1="春申君",   a2="信陵君",   a3="孟尝君",   a4="平原君",r=3},
					{id=75, title="春秋战国时期诸子百家不包括？",a1="道家",   a2="佛家",   a3="儒家",   a4="法家",r=2},
					{id=76, title="战国时期，与“合纵连横”这一外交军事政策关联的人物是？",a1="廉颇与蔺相如",   a2="王翦与王贲",   a3="孙膑与庞涓",   a4="苏秦与张仪",r=4},
					{id=77, title="历史上著名的“胡蓝之狱”发生在哪个朝代？",a1="唐",   a2="宋",   a3="明",   a4="清",r=3},
					{id=78, title="宋太祖赵匡胤通过哪个事件夺取政权建立宋朝？",a1="陈桥兵变",            a2="官渡之战",       a3="淮西兵变",   a4="巨鹿之战",r=1},
					{id=79, title="北宋建国时所定的京都（首都）是？",a1="长安",   a2="开封", a3="洛阳",   a4="金陵",r=2},
					{id=80, title="“农田水利法”是历史上哪次变法中提出的兴农措施？",a1="商鞅变法",   a2="庆历变法",          a3="欧阳修变法",  a4="王安石变法",r=4},
					{id=81, title="《资治通鉴》是中国第一部编年体通史，它的作者是？",a1="司马迁",  a2="司马炎",  a3="司马光",   a4="司马相如",r=3},
					{id=82, title="明代的小说有很高的艺术成就，著成《三国演义》的是？",a1="吴承恩",   a2="罗贯中", a3="曹雪芹",  a4="施耐庵",r=2},
					{id=83, title="以下三个皇帝按时间先后顺序排列正确的是？",a1="康熙雍正乾隆",   a2="雍正乾隆康熙",  a3="乾隆康熙雍正",   a4="雍正乾隆康熙",r=1},
					{id=84, title="清代号雪芹所著的小说《红楼梦》最初时命名为？",a1="《三生石》",   a2="《玉石记》",  a3="《石头记》",   a4="《玉石传奇》",r=3},
					{id=85, title="清朝推行“摊丁入亩”制度的皇帝是？",a1="雍正",   a2="乾隆",             a3="康熙",            a4="嘉庆",r=1},
					{id=86, title="古代著名的抒情诗《离骚》的作者是？",a1="柳宗元",   a2="李煜",   a3="荀子",   a4="屈原",r=4},
					{id=87, title="世界上最早记载“哈雷彗星”的书是？",a1="《春秋》",  a2="《左传》",   a3="《史记》",   a4="《淮南子》",r=1},
					{id=88, title="西周时期出现的“十五国风”指的是什么？",a1="十五种地方文字",  a2="十五种地方民歌",   a3="十五种民族装束",   a4="十五种民族礼仪",r=2},
					{id=89, title="古代六艺“礼、乐、射、御、书、数”中的御指得是什么？",a1="武术学习",  a2="礼仪学习",  a3="骑术学习",   a4="算数学习",r=3},
					{id=90, title="祖冲之第一个把圆周率准确推算到小数点后第几位？",a1="第五位",   a2="第六位",  a3="第七位",   a4="第八位",r=3},
					{id=91, title="清朝入关后的第一位皇帝是？",a1="康熙帝",   a2="雍正帝",  a3="乾隆帝",   a4="顺治帝",r=4},
					{id=92, title="著有《徐霞客游记》的徐霞客是哪个朝代的人？",a1="明朝",   a2="宋朝",          a3="元朝",   a4="清朝",r=1},
					{id=93, title="中国古代历法名著《授时历》的作者是谁？",a1="沈括",       a2="郭守敬",  a3="贾思勰",   a4="张衡",r=2},
					{id=94, title="“小时不识月，呼作白玉盘”是谁的名句？",a1="李白",   a2="白居易",  a3="柳宗元",   a4="陆游",r=1},
					{id=95, title="“何以解忧，唯有杜康”的作者是？",a1="李白",               a2="柳永",               a3="陆游",   a4="曹操",r=4},
					{id=96, title="“长风破浪会有时，直挂云帆济沧海”出自李白的哪首诗？",a1="《夜宿山寺》",   a2="《望庐山瀑布》",             a3="《行路难》",   a4="《月下独酌》", r=3},
					{id=97, title="古诗名句“黄鹤一去不复返”的下句是？",a1="芳草萋萋鹦鹉洲",  a2="烟波江上使人愁",      a3="此地空余黄鹤楼",   a4="白云千载空悠悠",r=4},
					{id=98, title="古诗名句“几处早莺争暖树”的下句是？",a1="何人倚剑白云天",  a2="谁家新燕啄春泥",  a3="不胜清怨却飞回",   a4="谁家柴门闻犬吠",r=2},
					{id=99, title="古诗名句“一骑红尘妃子笑”的下句是？",a1="无人知是荔枝来",   a2="半江瑟瑟半江红",          a3="二月春风似剪刀",  a4="笑问客从何处来",r=1},
					{id=100, title="古诗名句“大漠孤烟直”的下句是？",a1="燕山月似钩",   a2="白首卧松云",           a3="长河落日圆",   a4="山色有无中",r=3},
					{id=101, title="古诗名句“乱花渐欲迷人眼”的下句是？",a1="不知秋思落谁家",   a2="牧马群嘶边草绿",  a3="不见人影空见花",   a4="浅草才能没马蹄",r=4},
					{id=102, title="古诗名句“东边日出西边雨”的下句是？",a1="海上明月共潮生",   a2="道是无睛还有晴", a3="半作障泥半作帆",   a4="多少楼台烟雨中",r=2},
					{id=103, title="古诗名句“人生得意须尽欢”的下句是？",a1="莫使金樽空对月",   a2="千金散尽还复来",  a3="与尔同销万古愁",   a4="愁破方知酒有权",r=1},
					{id=104, title="“明月几时有？把酒问青天”出自苏轼的？",a1="《醉花阴》",   a2="《永遇乐》",           a3="《水调歌头》",   a4="《赤壁怀古》",r=3},
					{id=105, title="苏轼《赤壁怀古》中的“遥想公瑾当年”一句所指人物是？",a1="诸葛亮",   a2="孙权",   a3="刘备",   a4="周瑜",r=4},
					{id=106, title="宋词名句“无可奈何花落去”的下一句是？",a1="只有相思无尽处",   a2="似曾相识燕归来",  a3="无穷无尽是离愁",   a4="暗随流水到天涯",r=2},
					{id=107, title="“枯藤老树昏鸦，小桥流水人家”是谁的名句？",a1="辛弃疾",   a2="李清照",  a3="马致远",   a4="苏东坡",r=3},
					{id=108, title="中国十位名画家各有其长，擅长画虎的是？",a1="张大千",   a2="齐白石",  a3="黄胄",   a4="徐悲鸿",r=1},
					{id=109, title="现代杰出画家中，齐白石最擅长的是？",         a1="画鸟",   a2="画马",   a3="画虎",   a4="画虾",r=4},
					{id=110, title="《清明上河图》是哪个朝代的作品？",a1="北魏",   a2="北宋",  a3="西晋",   a4="盛唐",r=2},
					{id=111, title="世称“颜筋柳骨”的书法大家柳公权是哪个朝代的人物？",a1="隋朝",   a2="宋朝", a3="唐朝",   a4="明朝",r=3},
					{id=112, title="著名的《女史箴图》是哪位画家的作品？",a1="王羲之",   a2="吴道子",  a3="阎立本",  a4="顾恺之",r=4},
					{id=113, title="被誉为“书圣”的是哪位书法名家？",a1="王羲之",   a2="吴道子",  a3="顾恺之",   a4="阎立本",r=1},
					{id=114, title="有“画圣”美誉的吴道子是哪朝人？",a1="隋朝",   a2="宋朝",  a3="唐朝",   a4="明朝",r=3},
					{id=115, title="以草书见长，人称“草圣”的书法家是？",a1="欧阳询",   a2="张旭",  a3="王羲之",   a4="王献之",r=2},
					{id=116, title="被称为“天下第一行书”的是？",a1="苏轼的《黄州寒诗帖》",   a2="苏轼的《兰亭序》",  a3="苏轼的《黄州寒诗帖》",   a4="王羲之的《兰亭序》",r=4},
					{id=117, title="古诗名句“人生得意须尽欢”的下句是？",a1="莫使金樽空对月",   a2="千金散尽还复来",  a3="与尔同销万古愁",   a4="愁破方知酒有权",r=1},
					{id=118, title="下列哪个字具有汉字的八种基本笔画“点、横、竖、撇、捺、折、钩、提”？",a1="俗",   a2="松",  a3="永",   a4="宝",r=3},
					{id=119, title="古代书画按风格来讲，“工笔”绘画注重？",a1="细致写实",   a2="用笔简练",  a3="挥洒随意",   a4="场面宏大",r=1},
					{id=120, title="书画工艺中所称的“裱画”是指？",a1="张贴和收藏 对名家书画进行临摹" ,   a2="将书画雕刻成木制匾额",   a3="只有黑白而没有彩色的画",a4="为书画配上衬纸卷轴以便张贴和收藏",r=4},
					{id=121, title="世界上最早产茶饮茶的国家是？",a1="日本",   a2="中国", a3="印度",   a4="韩国",r=2},
					{id=122, title="以下不属于中草药的是？",a1="山楂",   a2="砌末",  a3="半夏",  a4="牛膝",r=2},
					{id=123, title="“麝香”取自动物的那个部分？",a1="雄鹿的颈部",   a2="雌鹿的腹部",  a3="雄鹿的腹部",   a4="雌鹿的颈部", r=3},
					{id=125, title="中医的“针灸”对人体穴位有很深的研究，以下位于人体手部的穴位是？",a1="印堂穴",  a2="膻中穴",   a3="风池穴",   a4="劳宫穴",r=4},
					{id=126, title="适量合理地饮用葡萄酒，对人体有什么好处？",a1="防治肺结核", a2="防治心血管病", a3="防治肝硬化",   a4="防治胆结石",r=2},
					{id=127, title="古诗名句“人生得意须尽欢”的下句是？",a1="莫使金樽空对月",   a2="千金散尽还复来",  a3="与尔同销万古愁",   a4="愁破方知酒有权",r=1},
					{id=128, title="一般情况下，用什么材质的桶贮藏葡萄酒？",a1="桃木",   a2="紫檀木", a3="橡木",  a4="胡杨木",r=3},
					{id=129, title="中国十大名茶之一的“龙井茶”原产地在哪个省？",a1="安徽省",   a2="福建省",  a3="广东省",   a4="浙江省",r=4},
					{id=130, title="按照一般市场行情，同样重量的以下中药最为贵重的是？",a1="柴胡",   a2="鹿茸",  a3="黄连",   a4="甘草",r=2},
					{id=131, title="安徽黄山所产的名茶众多，其中最为有名的是？",a1="铁观音",   a2="竹叶青",  a3="毛峰",   a4="大红袍",r=2},
					{id=132, title="绿茶、白茶、表茶、红茶是以什么为依据来划分的？",a1="茶叶本身的颜色",   a2="茶叶泡水后的颜色",  a3="茶叶的发酵程度",  a4="茶叶的味道浓淡",r=3},
					{id=133, title="中医的“针灸”对人体穴位有很深的研究，人体有一处“曲池穴”位于？",a1="肘部",   a2="颈部",      a3="手部",    a4="背部",r=1},
					{id=134, title="中药里所说的“陈皮”是指？",a1="晒干的橘皮",   a2="晒干的橙皮",  a3="晒干的柿皮",   a4="晒干的桂皮",r=1},
					{id=135, title="中医的“针灸”对人体穴位有很深的研究，人体有一处“涌泉穴”位于？",a1="背部",   a2="颈部", a3="头部",   a4="足底",r=4},
					{id=136, title="中国十大名茶之一的“白毫银针”原产地在哪个省？",a1="山西省",   a2="福建省", a3="浙江省",   a4="广东省",r=2},
					{id=137, title="中国第一部详细记述茶艺的著作是？",a1="西汉蔡襄的《茶录》",   a2="唐代蔡襄的《茶录》", a3="唐代陆羽的《茶经》",   a4="西汉陆羽的《茶经》",r=3},
					{id=138, title="龙井茶属于？",a1="黄茶",   a2="绿茶", a3="红茶",  a4="乌龙茶",r=2},
					{id=139, title="古人泡茶注重用水，以下被视为上等茶水的是？",a1="泉水",   a2="井水", a3="江水",   a4="雪融水",r=1},
					{id=140, title="以下哪项是加工绿茶时不会出现的步骤？",a1="揉捻",   a2="干燥",  a3="杀青",   a4="发酵",r=4},
					{id=141, title="中国古代酿酒的主要原料是？",a1="干果",   a2="粮食", a3="蔬菜",   a4="水果",r=2},
					{id=142, title="下列具有疏散风热、清目醒脑作用的一种中草药是？",a1="三七",  a2="黄葵",  a3="薄荷",  a4="牛黄",r=3},
					{id=143, title="下列具有清热解毒作用的一种中草药是？",a1="藏红花",   a2="白芍",  a3="柴胡",   a4="金银花",r=4},
					{id=144, title="中草药里“三七”的入药部分实际是植物的？",a1="根",   a2="茎", a3="叶",   a4="花",r=1},
					{id=145, title="古代所称的“杏林高手”是指？",a1="教书育人之人",  a2="医术高明之人",  a3="棋艺高超之人",   a4="茶艺高超之人",r=2},
					{id=146, title="古代医学著作《伤寒杂病论》的作者是？",a1="孙思邈",   a2="华佗",  a3="张仲景",  a4="扁鹊",r=3},
					{id=147, title="被誉为“茶仙、茶圣”的是？",a1="孙思邈",   a2="张广",  a3="徐霞客",   a4="陆羽",r=4},
					{id=148, title="提出“望闻问切”等医疗方式的是？",a1="扁鹊",   a2="孙思邈", a3="华佗",  a4="张仲景",r=3},
					{id=149, title="以下最早在中国出现的酒是哪一类？",a1="白酒",   a2="黄酒",  a3="红酒",  a4="啤酒",r=2},
					{id=150, title="喜好饮酒，自称“酒中仙”的著名诗人？",a1="杜甫",   a2="白居易",  a3="李白",   a4="陆游",r=3},
					{id=151, title="“煮酒论英雄”的典故发生在哪个时期？",a1="春秋时期",   a2="战国时期",  a3="魏晋时期",   a4="三国时期",r=4},
					{id=152, title="古代“重阳节”里有饮酒的习俗，所饮的酒是？",a1="茶花酒",   a2="菊花酒",  a3="梅花酒",   a4="雄黄酒",r=2},
					{id=153, title="中国最早的一部药物学著作是？",a1="《神农本草经》",   a2="《本草纲目》",  a3="《伤寒杂病论》",   a4="《千金方》",r=1},
					{id=154, title="配制世界上最早的麻醉药剂“麻沸散”的是？",a1="扁鹊",   a2="李时珍",  a3="华佗",   a4="张仲景",r=3},
					{id=155, title="中药“胖大海”的主要功效是？",a1="清热止痛",   a2="强筋健骨", a3="补肝养肾",  a4="润喉止咳",r=4},
					{id=156, title="中药里的“雄黄”属于？",a1="动物",   a2="矿物", a3="植物",  a4="合成药剂",r=2},
					{id=157, title="以下“不是”花茶中常用原料的是？",a1="君子兰",   a2="茉莉花",  a3="玫瑰",  a4="菊花",r=1},
					{id=158, title="酿酒工艺中所提到的“酒曲”是指？",a1="拜祭酒神时唱的歌曲",   a2="酿酒的作坊", a3="用来发酵的酿酒原料",  a4="一种盛酒用的容器", r=3},
					{id=159, title="以下不是古代药酒常用原料的是？",a1="虎骨",   a2="蛇胆",  a3="人参",  a4="鸡尾",r=4},
					{id=160, title="三国演义里“木牛流马”是谁制造的？",a1="周瑜",   a2="诸葛亮",  a3="张飞",   a4="曹操",r=2},
					{id=161, title="中国的四大名绣是？",a1="苏绣、鲁绣、蜀绣、粤绣", a2="苏绣、湘绣、蜀绣、鲁绣", a3="苏绣、湘绣、蜀绣、粤绣",   a4="鲁绣、湘绣、蜀绣、粤绣",r=3},
					{id=162, title="黑火药是中国古代四大发明之一，它的混合成分不包括？",a1="硝石",   a2="甘油",  a3="木炭",   a4="硫磺",r=2},
					{id=163, title="马踏飞燕又称为马超龙雀，是什么朝代青铜艺术的杰出代表？",a1="东汉",   a2="西汉",  a3="东魏",   a4="西晋",r=1},
					{id=164, title="皮影戏最早诞生在两千年前的西汉，它“发祥于”中国哪个地区？",a1="山西",   a2="河北",  a3="山东",   a4="陕西",r=4},
					{id=165, title="被称为“国际土木工程历史古迹”的是？",a1="卢沟桥",   a2="安平桥", a3="赵州桥",  a4="广济桥",r=3},
					{id=166, title="古诗名句“人生得意须尽欢”的下句是？",a1="莫使金樽空对月",   a2="千金散尽还复来",  a3="与尔同销万古愁",   a4="愁破方知酒有权",r=1},
					{id=167, title="承德避暑山庄是哪个皇帝开始建造？",a1="雍正",   a2="康熙",  a3="乾隆",  a4="武则天",r=2},
					{id=168, title="尊是古代的一种容器，它一般用于承装什么物品？",a1="米",   a2="面",  a3="蔬菜",   a4="酒",r=4},
					{id=169, title="紫砂壶作为茶具和工艺品已有悠久历史，它的原产地在哪里？",a1="酒兴",   a2="台州",  a3="宜兴",   a4="嘉兴",r=3},
					{id=170, title="古代被称为“天南贡品”的是哪种工艺品？",a1="椰雕",  a2="贝雕",  a3="云雕",  a4="泥塑",r=1},
					{id=171, title="《天工开物》是明代记载农业手工业技术的著作，它作者是？",a1="贾思勰",   a2="徐霞客",  a3="司马炎",   a4="宋应星",r=4},
					{id=172, title="西藏布达拉宫反映了中国建筑工艺的高超，这座宫殿在取材上属于？",a1="全木结构",  a2="石木结构",  a3="石质结构",   a4="金石结构",r=2},
					{id=173, title="北宋的赵括所著的《梦溪笔谈》主要记载的是？",a1="古代工艺",   a2="古代茶艺",  a3="古代科技",   a4="古代建筑",r=3},
					{id=174, title="宋代制瓷业非常繁荣，著名的汝窑位于哪个省？",a1="河南",   a2="安徽",  a3="江西",  a4="云南",r=3},
					{id=175, title="东汉时期，纸张逐渐代替竹简和丝帛来书写文字，发明纸张的是？",a1="毕昇",  a2="张衡",  a3="鉴真",  a4="蔡伦",r=4},
					{id=176, title="发明了世界上第一台监测报告的地震仪的是？",a1="祖冲之",   a2="张衡",  a3="沈括",   a4="鲁班",r=2},
					{id=177, title="古代工艺中的“云雕”是指？",a1="一种木雕工艺",   a2="一种蜡染工艺",  a3="一种漆雕工艺",  a4="一种石雕工艺",r=3},
					{id=178, title="秦代的“兵马俑”体现了古代工匠的哪项高超技艺？",a1="制陶工艺",   a2="青铜工艺",      a3="根雕艺术",   a4="蜡染工艺",r=1},
					{id=179, title="古代新春有贴年画的习俗，画中的鲤鱼代表哪种寓意？",a1="步步高升",   a2="吉祥如意",  a3="财源广进",   a4="连年有余",r=4},
					{id=180, title="翡翠是古代一种贵重的玉器材料，它在材质上属于？",a1="金属",   a2="矿物", a3="化石",   a4="合成材料",r=2},
					{id=181, title="古代民间所用的“顶针”属于？",a1="女子装饰品",   a2="一种暗器", a3="缝纫用具",   a4="农用耕具",r=3},
					{id=182, title="元曲四大家是哪四个？",a1="马致远，白朴，郑光祖，关汉卿",   a2="马致远，白朴，李清照，关汉卿",a3="李清照，白朴，郑光祖，关汉卿",   a4="马致远，白朴，郑光祖，李清照",r=1},
					{id=183, title="围棋棋盘上一共有多少个交叉点？",a1="360",   a2="361",  a3="365",   a4="366",r=2},
					{id=184, title="以下哪种乐器是龟兹乐器？",a1="凤阳鼓",  a2="水鼓",  a3="竹鼓",   a4="羯鼓",r=4},
					{id=185, title="关于琴的古代故事“说琴谏国王” 所说的是？",a1="刘赞谏秦王",  a2="苏秦谏赵王",       a3="邹忌谏齐王",   a4="春申谏楚王",r=3},
					{id=186, title="中国古代最早出现的乐器是哪一类？",a1="吹奏乐器",  a2="弹奏乐器",  a3="打击乐器",   a4="弓弦乐器",r=1},
					{id=187, title="下面哪种不是古代的乐器？",a1="筑",   a2="镗",  a3="铙",   a4="磬",r=2},
					{id=188, title="关于围棋的说法，下面哪个是错误的？",a1="围棋棋盘由横竖各十九条线组成",  a2="没气的棋子被取下棋盘成为“提子”", a3="下棋时以执黑一方先行"  , a4="围棋的棋子分数量相同的黑白两色",r=4},
					{id=189, title="以下哪一个是象棋中不会出现的走法？",a1="兵七平六",   a2="炮八平七",  a3="象四进五",   a4="马三进四",r=3},
					{id=190, title="中国象棋棋盘上的“米”字形方框叫做？",a1="九宫",   a2="天元",  a3="本垒",   a4="本营",r=1},
					{id=191, title="以下关于象棋的说法，哪个是正确的？",a1="兵和卒只允许向前行，不能后退或平移",   a2="象棋起源较早，战国时期就已有记载", a3="中国象棋有三十四个棋子，一般分为红、黑两组",   a4="棋盘中间用来划分边界的地方称为“秦河汉界”",r=2},
					{id=192, title="以下哪一个是象棋中不会出现的走法？",a1="马三退二",  a2="兵七平六",  a3="马三退五",  a4="士二进四",r=4},
					{id=193, title="围棋棋盘的图案是？",a1="横竖各十九条线",  a2="横竖各二十条线",  a3="横十九竖二十条线",  a4="横二十竖十九条线",r=1},
					{id=194, title="按音律的风格情趣划分，与阳春白雪截然相反的是？",a1="高山流水",  a2="春江花月夜",  a3="下里巴人",   a4="汉宫秋月",r=3},
					{id=195, title="古代流传的名曲“十面埋伏”主要由哪种乐器演奏？",a1="木鱼",   a2="琵琶",  a3="古筝",   a4="笛子",r=2},
					{id=196, title="以下不属于象棋术语的是？",a1="巡河车",   a2="鸳鸯马",  a3="屏风马",   a4="边前象",r=4},
					{id=197, title="以下属于围棋术语的是？",a1="三连星",   a2="三连斩",  a3="三连和",  a4="三连挂",r=1},
					{id=198, title="下列古代乐器中，属于少数民族乐器的是？",a1="笛子",   a2="马头琴",  a3="古筝",   a4="编钟",r=2},
					{id=199, title="民族乐器“葫芦丝”按演奏方式划分属于？",a1="弹奏类乐器",   a2="打击类乐器",  a3="吹奏类乐器",   a4=" 拉弦类乐器", r=3},
					{id=200, title="“二胡”是民间常见的拉弦乐器，它的琴弦数目是？",a1="一根",   a2="两根",  a3="三根",   a4="五根",r=2},
					{id=201, title="“大弦嘈嘈如急雨，小弦切切如私语”描述的是哪种乐器？",a1="古筝",   a2="二胡",  a3="柳琴",   a4="琵琶",r=4},
					{id=202, title="琵琶顶部的“弦轴”作用是？",a1="调节音高",  a2="便于携带",  a3="调节颤音",   a4="增加共鸣",r=1},
					{id=203, title="象棋中的“卧槽马”是指？",a1="被对方困住无法移动的马",    a2="在对方将前一格形成将军的马", a3="在对方将前一格形成将军的马",  a4="走至棋盘底线的马",r=3},
					{id=204, title="以下象棋的棋子中不能走直线的是？",a1="炮",   a2="象",  a3="兵",   a4="将",r=2},
					{id=205, title="古代四大美女在唐朝的是？",a1="杨玉环",   a2="貂蝉",  a3="西施",   a4="王昭君",r=1},
					{id=206, title="古代书法家中,和张旭齐名，称“素狂”的是谁？",a1="谢素",   a2="齐素",  a3="关素",   a4="怀素",r=4},
					{id=207, title="唐朝的开国皇帝是？",a1="李煜",   a2="李世民",  a3="李渊",  a4="李信",r=3},
					{id=208, title="“初唐四杰”除了杨炯、王勃、卢照邻，还有谁？",a1="骆宾王",   a2="张旭",  a3="怀素",   a4="王啸林",r=1},
					{id=209, title="《陋室铭》的作者是谁？",a1="陆游",   a2="徐霞客",  a3="柳宗元",   a4="刘禹锡",r=4},
					{id=210, title="开元盛世是哪个皇帝所创？",a1="李世民",   a2="李隆基",  a3="李煜",   a4="李信",r=2},
					{id=211, title="《千金方》的作者，被称为医圣的是？",a1="李时珍",   a2="扁鹊",  a3="孙思邈",   a4="华佗",r=3},
					{id=212, title="“以史为鉴，可以知兴替，以人为鉴，可以明得失、”这是唐太宗对谁的评价？",a1="狄仁杰",   a2="上官婉儿",  a3="李庆",   a4="魏征",r=4},
					{id=213, title="唐朝两位最著名的诗人中，被称为诗圣的是？",a1="白居易",   a2="杜甫",  a3="杜牧",  a4="陆游",r=2},
					{id=214, title="与杜牧并称为“小李杜”的是谁？",a1="李煜",   a2="李子横",  a3="李商隐",   a4="李信",r=3},
					{id=215, title="唐朝著名诗人被称作诗佛的是谁？",a1="李煜",   a2="杜牧",  a3="白居易",   a4="王维",r=4},
					{id=216, title="唐朝诗人白居易，字乐天，号什么？",a1="香山居士",   a2="太平居士",  a3="柳荫居士",   a4="安阳居士",r=1},
					{id=217, title="玄奘口述，弟子记的西方见闻书是什么？",a1="《西游记》",   a2="《东行记》",  a3="《取经记》",   a4="《大唐西域记》",r=4},
					{id=218, title="文成公主前往和亲的国家？",a1="蒙古",   a2="吐蕃",  a3="波斯",   a4="天竺",r=2},
					{id=219, title="唐朝除都城长安外的东都在哪儿？",a1="开封",   a2="商河",  a3="洛阳",   a4="西安",r=3},
					{id=220, title="“会当凌绝顶，一览众山小”指的是哪座名山？",a1="黄山",   a2="衡山",  a3="峨眉山",   a4="泰山",r=4},
					{id=221, title="“日照香庐升紫烟”诗句中哪座山？",a1="庐山",   a2="泰山", a3="黄山",   a4="衡山",r=1},
					{id=222, title="“春蚕到死丝方尽，蜡炬成灰泪始干”常被用来歌颂什么职业的人？",a1="园丁",   a2="教师",  a3="交警",   a4="环卫人员",r=2},
					{id=223, title="三横三坚是什么字？",a1="土",   a2="丰",  a3="田",   a4="心",r=3},
					{id=224, title="“随风潜入夜，润物细无声、”描写的是什么天气？",a1="冰雹",   a2="大雾",  a3="霜冻",   a4="小雨",r=4},
					{id=225, title="1到100的100个数字中,共有多少个9字呢？",a1="19",   a2="20",  a3="21",   a4="22",r=2},
					{id=226, title="猴子每分钟能掰1个玉米，在果园里，一只猴子5分钟能掰几个玉米？",a1="1",   a2="2",  a3="3",   a4="0",r=4},
					{id=227, title="唐朝以前的月饼叫什么？",a1="胡饼",  a2="馅饼",  a3="枣饼",   a4="糖饼",r=1},
					{id=228, title="人一生说的最多的三个字是什么？",a1="对不起",   a2="谢谢你",  a3="怎么了",   a4="不知道",r=4},
					{id=229, title="七夕起源于什么时候？",a1="春秋战国时期",   a2="三国时期",  a3="汉代",   a4="清代",r=3},
					{id=230, title="古代说的五胡指匈奴、羯、氐、羌和什么？",a1="藏",   a2="鲜卑",  a3="蒙",   a4="朝",r=2},
					{id=231, title="古代乐器，按用途可分为两类，分别是祭祀和什么？",a1="宴会",   a2="庆祝",  a3="婚宴",   a4="喜庆",r=1},
					{id=232, title="钱永健获得了诺贝尔什么奖？",a1="物理",   a2="文学",  a3="和平",   a4="化学",r=4},
					{id=233, title="“何以解忧，唯有杜康、”杜康指什么？",a1="美味佳肴",   a2="书籍",  a3="美酒",   a4="经文",r=3},
					{id=234, title="在中国，青铜的出现标志着什么时候的到来？",a1="青铜时代",   a2="铁器时代",  a3="石器时代",   a4="文明时代",r=4},
					{id=235, title="《绝代双骄》中“玉郎”是谁的别名？",                  a1="燕南天",         a2="江枫",       a3="小鱼儿",     a4="花无缺",               r=2},
					{id=236, title="《绝代双骄》中江枫与燕南天是什么关系？",                    a1="情敌",         a2="仇人",       a3="父子",     a4="好朋友",               r=4},
					{id=237, title="《绝代双骄》中被称为天下第一神剑的是谁？",                  a1="江枫",         a2="江琴",       a3="燕南天",     a4="江玉郎",               r=3},
					{id=238, title="《绝代双骄》中江琴是江枫的？",                  a1="哥哥",         a2="弟弟",       a3="保镖",     a4="书童",               r=4},
					{id=239, title="《绝代双骄》中江枫逃亡时派谁去向燕南天求助？",                  a1="十大恶人",         a2="江琴",       a3="十二星象",     a4="怜星宫主",               r=2},
					{id=240, title="《绝代双骄》中出卖江枫的人是谁？",                  a1="十二星相",         a2="燕南天",       a3="江琴",     a4="金猿星",               r=3},
					{id=241, title="《绝代双骄》中十大恶人里被人称作“不男不女”的是？",                  a1="杜杀",         a2="李大嘴",       a3="屠娇娇",     a4="哈哈儿",               r=3},
					{id=242, title="《绝代双骄》中十大恶人里被人称作“不吃人头”的是？",                  a1="屠娇娇",         a2="李大嘴",       a3="哈哈儿",     a4="杜杀",               r=2},
					{id=243, title="《绝代双骄》中十大恶人里被人称作“笑里藏刀”的是？",                  a1="哈哈儿",         a2="屠娇娇",       a3="杜杀",     a4="李大嘴",               r=1},
					{id=244, title="《绝代双骄》中十大恶人里被人称作“半人半鬼”的是？",                  a1="屠娇娇",         a2="阴九幽",       a3="哈哈儿",     a4="杜杀",               r=2},
					{id=245, title="《绝代双骄》中十大恶人之首是谁？",                  a1="哈哈儿",         a2="屠娇娇",       a3="杜杀",     a4="阴九幽",               r=3},
					{id=246, title="《绝代双骄》中燕南天在“恶人谷”中放过的名医是？",                  a1="万春流",         a2="杜杀",       a3="阴九幽",     a4="司马烟",               r=1},
					{id=247, title="《绝代双骄》中“迷死人不赔命”指的是？",                  a1="屠娇娇",         a2="萧咪咪",       a3="江枫",     a4="花无缺",               r=2},
					{id=248, title="《绝代双骄》中小鱼儿因什么而得名？",                  a1="他出生在有鱼儿的小溪边",         a2="他出生时身形小的不过鱼儿大小",       a3="被视为漏网之鱼",     a4="以上皆不是",               r=3},
					{id=249, title="《绝代双骄》中被称为“小仙女”的是谁？",                  a1="张菁",         a2="铁心兰",       a3="苏樱",     a4="桃花",               r=1},
					{id=1, title="国际足联最近首次认定足球起源于_____",  a1="中国", a2="英国", a3="德国", a4="巴西", r=1},
					{id=2, title="重阳节又称老人节，人们在这一天有插茱萸，饮_____酒，登山，吃重阳糕等风俗。",        a1="桃花", a2="菊花", a3="梅花", a4="桂花", r=2},
					{id=3, title="最先发现了白色光组成的是_____",            a1="爱因斯坦", a2="伽俐略", a3="伦琴", a4="牛顿", r=4},
					{id=4, title="遵义会议批评揭发了第几次反围剿的错误？",  a1="1", a2="3", a3="4", a4="5", r=4},
					{id=5, title="世界上最高级的爬行动物是_____",            a1="蛇", a2="鳄鱼", a3="龟", a4="蜥蜴", r=2},
					{id=7, title="著名的四大名旦是梅兰芳、程砚秋、尚小云以及_____",        a1="荀慧生", a2="赵薇", a3="陈秀珠", a4="叶盛兰", r=1},
					{id=8, title="曾在年轻时弃医从文的作家是_____",      a1="鲁迅", a2="茅盾", a3="郭沫若", a4="冰心", r=3},
					{id=9, title="凿壁偷光的典故与谁有关？",      a1="匡衡", a2="郭敬", a3="岳飞", a4="孙敬", r=1},
					{id=10, title="中国历史上第一个王朝时代是_____",         a1="商", a2="夏", a3="周", a4="秦", r=2},
					{id=11, title="“红藕香残玉簟秋。轻解罗裳，独上兰舟。雪中谁寄锦书来，雁字回时，月满西楼。”出自哪首词？",           a1="李煜的《长相思》", a2="柳永的《雨霖铃》", a3="李清照的《一剪梅》", a4="辛弃疾的《念奴娇》", r=3},
					{id=12, title="号称“中国的天下第一关”的著名景点是_____",   a1="玉门关", a2="雁门关", a3="友谊关", a4="山海关", r=4},
					{id=13, title="整个人浸在水里游泳时在哪里受到的浮力大？",         a1="浅水", a2="深水", a3="浅水深水都一样", a4="不知道", r=3},
					{id=14, title="哪种茶叶存放的时间越久越珍贵？",       a1="普洱茶", a2="乌龙茶", a3="龙井茶", a4="铁观音", r=1},
					{id=15, title="植物界中种类最多的是_____",     a1="种子植物", a2="裸子植物", a3="被子植物", a4="草本植物", r=3},
					{id=17, title="“孔雀东南飞”下一句是_____", a1="一步一回头", a2="五里一徘徊", a3="飞到天涯去不回", a4="心知长别离", r=2},
					{id=19, title="葡萄是从哪里传入中国的？",          a1="西域", a2="欧洲", a3="美洲", a4="大洋洲", r=1},
					{id=20, title="中国哪位歌唱家被世界三大男高音歌唱家之一的帕瓦罗蒂收为徒弟？", a1="魏松", a2="吕继宏", a3="戴玉强", a4="蒋大为", r=3},
					{id=21, title="请将下句歇后语补充完整：”打着灯笼过铁道——“",          a1="白费蜡", a2="见鬼", a3="瞎打", a4="看不清", r=2},
					{id=22, title="正常人体体细胞有多少条染色体？",          a1="44", a2="45", a3="46", a4="47", r=3},
					{id=23, title="世界地球日是每年的哪一天？",          a1="3月23日", a2="3月24日", a3="4月21日", a4="4月22日", r=4},
					{id=24, title="《史记》共分多少部？",          a1="3", a2="4", a3="5", a4="6", r=4},
					{id=25, title="《山海经》是中国最早一部记载什么内容的文学作品？",          a1="地理", a2="历史", a3="传说", a4="人文", r=1},
					{id=27, title="“一衣带水”的“水”指的是____",          a1="长江", a2="黄河", a3="黑龙江", a4="自来水", r=1},
					{id=28, title="“一问三不知”中的”三不知“最早是指____",          a1="天、地、人", a2="事情的开始、经过、结果", a3="爷爷、爸爸、哥哥", a4="儒、释、道三教", r=2},
					{id=29, title="风力等级达到“清风”时陆地物象为____ ",          a1="感觉有风", a2="烟示风向", a3="吹起尘土", a4="旌旗展开", r=3},
					{id=30, title="以下哪个国家不包括八国联军之内？",          a1="意大利", a2="俄罗斯", a3="日本", a4="加拿大", r=4},
					{id=31, title="三十六计第一计是_____",          a1="一箭双雕", a2="瞒天过海", a3="调虎离山", a4="声东击西", r=2},
					{id=32, title="“一山有四季，十里不同天”反映了_____对气候的影响。",          a1="纬度位置", a2="海陆因素", a3="地形因素", a4="洋流因素", r=3},
					{id=33, title="古代“六艺”不包括以下哪个？",          a1="礼", a2="书", a3="射", a4="棋", r=4},
					{id=34, title="五种毒虫不包括以下哪个？",          a1="蛇", a2="蜈蚣", a3="壁虎", a4="蜥蜴", r=4},
					{id=35, title="“一日不见，如隔三秋”里的“三秋”是指_____",          a1="三个秋天", a2="三个月", a3="三个季度", a4="三天", r=3},
					{id=36, title="“大弦嘈嘈如急雨，小弦切切如私语。”下两句是_____",          a1="嘈嘈切切错杂弹，大珠小珠落玉盘。", a2="弦弦掩抑声声思，似诉平生不得志。", a3="曲终收拨当心画，四弦一声如裂帛。", a4="转轴拨弦三两声，未成曲调先有情。", r=1},
					{id=37, title="“月有阴晴圆缺”是由什么引起的？",          a1="月亮绕地球运动", a2="地球绕太阳运动", a3="月亮自转", a4="天狗吃月", r=1},
					{id=38, title="“明修栈道，暗渡陈仓”中的“陈仓”是指现在的_____",          a1="山西太原", a2="陕西宝鸡", a3="江西萍乡", a4="湖北黄岗", r=2},
					{id=39, title="《百家姓》成书于哪朝？",   a1="唐朝", a2="宋朝", a3="汉朝", a4="元朝", r=2},
					{id=40, title="唐朝诗人许浑所作的《咸阳城东楼》中”山雨欲来风满楼“的上一句是_____",           a1="一上高楼万里愁", a2="抽刀断水水更流", a3="溪云初起日沉阁", a4="长风万里送秋雁", r=3},
					{id=41, title="“商女不知亡国恨，隔江犹唱后庭花”中暗指了一个皇帝，他是_____",         a1="李煜", a2="李隆基", a3="陈后主", a4="杨广", r=3},
					{id=42, title="“尚方宝剑”中的“尚方”最初是指_____",      a1="皇帝授命", a2="官署名", a3="皇帝使用过的", a4="铸剑厂名", r=2},
					{id=43, title="“生死一知己，存亡两妇人”指的是哪个历史人物？",      a1="伍子胥", a2="岳飞", a3="谭嗣同", a4="韩信", r=4},
					{id=44, title="“诗鬼”是指_____",        a1="李白", a2="杜甫", a3="李贺", a4="李商隐", r=3},
					{id=45, title="“诗中有画，画中有诗”是谁对谁的诗歌的评论？",          a1="钟嵘对陶渊明", a2="苏轼对王维", a3="欧阳修对李白", a4="王国维对苏轼" , r=2},
					{id=46, title="“世界第一墓”是指_____",            a1="埃及金字塔", a2="秦始皇陵", a3="泰姬玛哈陵", a4="仁德天皇陵", r=4},
					{id=47, title="“多情自古伤离别，更那堪，冷落清秋节。”出自_____",  a1="柳永", a2="李煜", a3="辛弃疾", a4="李清照", r=1},
					{id=48, title="“扬州八怪”是哪一时期在江苏扬州活动的一批职业画家？",            a1="万历", a2="康熙", a3="雍正", a4="乾隆", r=2},
					{id=50, title="“阳关大道”原是指通往哪里的路？",  a1="东海", a2="西域", a3="漠北", a4="中原", r=2},
					{id=51, title="“莫氏空翻”是谁独创？",          a1="刘璇", a2="莫慧兰", a3="毕文静", a4="程菲", r=2},
					{id=52, title="《百鸟朝凤》是一部什么曲目？",          a1="二胡独奏曲", a2="琵琶曲", a3="古筝曲", a4="唢呐曲", r=4},
					{id=53, title="《昌黎先生集》根据什么命名？",          a1="地名", a2="谥号", a3="人名", a4="年号", r=1},
					{id=54, title="四川民族众多，其中有中国唯一的_____族聚居地",          a1="傣", a2="彝", a3="羌", a4="毛南", r=3},
					{id=55, title="《题临安邸》中“山外青山楼外楼”的下句是_____",          a1="平明送客楚山孤", a2="西湖歌舞几时休", a3="还有手高在前头", a4="碧水东流至此回", r=2},
					{id=56, title="“山药蛋派”的代表作家是_____",          a1="刘绍棠", a2="丛维熙", a3="孙犁", a4="赵树理", r=4},
					{id=57, title="“生命诚可贵，爱情价更高”的作者是哪国人？",          a1="匈牙利", a2="俄国", a3="中国", a4="法国", r=1},
					{id=58, title="《神曲》的作者是谁？",          a1="但丁", a2="荷马", a3="莎士比亚", a4="狄更生", r=1},
					{id=60, title="“诗仙”是指唐朝的哪位诗人？",          a1="李白", a2="杜甫", a3="白居易", a4="李贺", r=1},
					{id=62, title="“腰缠万贯”形容人有许多钱，在古代一贯钱有多少？",          a1="1枚铜钱", a2="100枚铜钱", a3="1000枚铜钱", a4="10枚铜钱", r=3},
					{id=63, title="“一千零一夜”又名“天方夜潭”，“天方”指的是____",          a1="天边的地方", a2="古代阿拉伯", a3="古代希腊", a4="古代欧洲", r=2},
					{id=64, title="“一寸光阴一寸金”下句是____",          a1="寸金难买寸光阴", a2="黄金能买一寸阴", a3="一寸光阴值一金", a4="光阴黄金正同斤", r=1},
					{id=65, title="“伊厥石窟”是以下哪个石窟的别称？",          a1="敦煌莫高窟", a2="云岗石窟", a3="麦积山石窟", a4="龙门石窟", r=4},
					{id=66, title="“印加文明”是指____",          a1="南美的古代文明", a2="埃及的古代文明", a3="印度的古代文明", a4="欧洲的古代文明", r=1},
					{id=67, title="“玉荷花”是以下哪种植物的俗称？",          a1="荷花", a2="玉兰花", a3="桅子花", a4="水仙花", r=2},
					{id=68, title="元宵节吃元宵的习俗始于哪个朝代？",          a1="汉朝", a2="唐朝", a3="宋朝", a4="元朝", r=3},
					{id=69, title="荷兰的国花是____",          a1="郁金香", a2="牡丹", a3="康乃馨", a4="紫罗兰", r=1},
					{id=70, title="“澶渊之盟”的议定地点澶州是今天的____",          a1="河南开封", a2="河南濮阳", a3="安徽合肥", a4="安徽芜湖", r=2},
					{id=71, title="昭君出塞，指是哪个塞？",          a1="五原塞", a2="光录塞", a3="玉门关", a4="雁门关", r=2},
					{id=72, title="“知天命”代指什么年纪？",          a1="60岁", a2="70岁", a3="50岁", a4="80岁", r=3},
					{id=73, title="“知我者谓我心忧，不知我者谓我何愁”出自____",          a1="《论语》", a2="《孟子》", a3="《诗经》", a4="《汉乐府》", r=3},
					{id=74, title="“指鹿为马”这一典故说是谁？",          a1="李斯", a2="章邯", a3="赵高", a4="吕布", r=3},
					{id=75, title=" “智者千虑，必有一失”语出____ ",          a1="《老子》", a2="《晏子春秋》", a3="《庄子》", a4="《论语》", r=2},
					{id=76, title="中秋节吃月饼最初的兴起是因为____",          a1="欢庆家人团圆", a2="效法天狗吃月", a3="推翻元朝统治", a4="以上答案都正确", r=3},
					{id=77, title=" “逐鹿中原”是指什么时代群雄纷争的史实？",          a1="春秋时期", a2="战国时期", a3="三国时期", a4="秦末", r=4},
					{id=78, title=" “醉翁之意不在酒”中的“醉翁”指的是____ ",          a1="陶渊明", a2="李白", a3="杜甫", a4="欧阳修", r=4},
					{id=79, title="“总角之交”是指____",          a1="顽童之交", a2="少年之交", a3="中年之交", a4="忘年之交", r=2},
					{id=80, title="“足球王国”是指哪个国家？",          a1="德国", a2="荷兰", a3="巴西", a4="阿根廷", r=3},
					{id=81, title="“座山雕”是一种什么鸟？",          a1="秃鹫", a2="巨嘴鸟", a3="铜鸡", a4="信天翁", r=1},
					{id=82, title="《八墓村》是谁的作品？",          a1="海岩", a2="横沟正史", a3="江户川乱步", a4="柯南·道尔", r=2},
					{id=83, title="“一言而为天下法”一语中的“法”是指____",          a1="法国", a2="效法", a3="方法", a4="准则", r=2},
					{id=84, title="《八墓村》是哪国作家的作品？",          a1="中国", a2="美国", a3="日本", a4="越南", r=3},
					{id=85, title="《落花生》是以下哪位作家的代表作？",          a1="朱自清", a2="闻一多", a3="陈寅恪", a4="许地山", r=4},
					{id=86, title="《马赛曲》是哪个国家的国歌？",          a1="英国", a2="德国", a3="土耳其", a4="法国", r=4},
					{id=88, title="世界上什么东西比天高？",          a1="手", a2="眼睛", a3="思想", a4="心", r=4},
					{id=89, title="《霓裳羽衣》是哪个朝代的作品？",          a1="唐朝", a2="明朝", a3="宋朝", a4="元朝", r=1},
					{id=90, title="《千里江山图》在我图堪称青山绿水之典范，它的作者是____",          a1="赵佶", a2="黄庭坚", a3="王希孟", a4="阎立本", r=3},
					{id=92, title="欧洲银行在哪个国家？",          a1="德国", a2="比利时", a3="英国", a4="法国", r=1},
					{id=93, title="在中国，重庆市巫山县发现的巫山人化石，距今有多少万年？",          a1="100万", a2="200万年", a3="300万年", a4="400万年", r=2},
					{id=94, title="在欧美人眼里，紫罗兰代表____",          a1="爱情", a2="谎言", a3="死亡", a4="诚实", r=4},
					{id=95, title="“众芳摇落独暄妍，占尽风情向小园。疏影横斜水清浅，暗香浮动月黄昏。”形容的花是____",          a1="桂花", a2="山园小梅", a3="月季", a4="牡丹", r=2},
					{id=96, title="《清明上河图》的作者是____",          a1="顾恺之", a2="周昉", a3="张择端", a4="齐白石", r=3},
					{id=97, title="《儒林外史》是一部什么小说？",          a1="讽刺小说", a2="言情小说", a3="历史小说", a4="传奇小说", r=1},
					{id=98, title="《伤寒杂病论》由谁所著？",          a1="孙思邈", a2="李时珍", a3="张仲景", a4="张简斋 ", r=1},
					{id=99, title="杨凡的组织叫什么？",          a1="山流", a2="青衣楼", a3="青龙会", a4="天尊", r=1},
					{id=100, title="在伤口愈合时不宜食用____",          a1="食盐", a2="酱油", a3="陈醋", a4="味精", r=2},
					{id=101, title="请将下句歇后语补充完整：“白骨精演说____”",          a1="妖言惑众", a2="把我当唐僧", a3="不是行家", a4="杀了我吧，完全不懂", r=1},
					{id=102, title="“名列前茅”指名次排在前面，那么“茅”最初指的是____",          a1="一种草", a2="姓茅的人", a3="草房子", a4="一种武器", r=2},
					{id=103, title="“沐猴而冠”在《史记》中讽刺的是____",          a1="刘邦", a2="项羽", a3="张良", a4="英布", r=2}
					} 
			
			NpcSayParty("现在开始中国梦幻古龙游泳大赛的第一关，我决定考验下你们的才学如何。")
			if not bProcess then return end
			script:SetSaying(true)
			script:SetAsking(true)
			local R = RandTable(Question)
			NpcAskParty(string.format("%s（需要队伍中所有的成员都答对才可过关）",R.title))
			SetAnswer(1, string.format("%s",R.a1))
			SetAnswer(2, string.format("%s",R.a2))
			SetAnswer(3, string.format("%s",R.a3))			
			SetAnswer(4, string.format("%s",R.a4))
			WaitAnswer(1,30)
			for i = 0, party:GetRealMemNum() - 1 do
				local member = party:GetInPartyMember(i)
				local answer = GetAnswer(i)
				if answer ~= R.r then
					NpcSayParty(string.format("十分抱歉，看来\#P%s\#W还不够博学呀，闯关失败，请休息\#G3\#W分钟再来闯关。",member:GetName()))
					for i = 0, party:GetRealMemNum() - 1 do
						local member = party:GetInPartyMember(i)
						member:GetQuests():SetTimeMark(697)
					end
					return
				elseif i == party:GetRealMemNum() - 1 then
					--if bProcess then return end
					--script:SetSaying(true)
					NpcSayParty("五位大侠不仅武艺高强，而且也是才高八斗，在下佩服。你们可以到下一关挑战了。")
					Quest69203:Take()
				end
			end
			
		end
	end
end
-- 必需在脚本最后将 NPC 表加入系统中
AddNpcTable(Npc300086)